rails/depot3/app/controllers/line_items_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?) RETURNING "id"  [["created_at", "2024-09-20 06:23:28.947970"], ["updated_at", "2024-09-20 06:23:28.947970"]]
INSERT INTO "line_items" ("product_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["product_id", 6], ["cart_id", 2], ["created_at", "2024-09-20 06:38:16.678730"], ["updated_at", "2024-09-20 06:38:16.678730"]]
---
  def create

    logger.info params

    product = Product.find(params[:product_id])
    @line_item = @cart.line_items.build(product: product)

    # @line_item = LineItem.new(line_item_params)

    respond_to do |format|
      if @line_item.save