rails/depot3/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["name", "admin"], ["password_digest", "[FILTERED]"], ["created_at", "2024-09-19 06:18:23.219078"], ["updated_at", "2024-09-19 06:18:23.219078"]]