rails/asudpp/app/controllers/application_controller.rb

  def current_user
    # return unless session[:user_id]
    return unless session.fetch(:user_id)
    @current_user ||= User.find(session.fetch(:user_id))
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]