rails/asudpp/app/controllers/contracts_controller.rb

SELECT "contracts".* FROM "contracts" WHERE "contracts"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
  def show
    @contract = Contract.find(params[:id])

INSERT INTO "contracts" ("number", "date", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["number", "11/20"], ["date", "2020-01-21"], ["description", "Договор на поставку ППДГ-1200-200-У2"], ["created_at", "2024-09-17 08:45:30.089519"], ["updated_at", "2024-09-17 08:45:30.089519"]]
---
  def create
    @contract = Contract.new(contract_params)

    respond_to do |format|
      if @contract.save

UPDATE "contracts" SET "description" = ?, "updated_at" = ? WHERE "contracts"."id" = ?  [["description", "Договор на поставку одного выпрямителя"], ["updated_at", "2024-09-18 12:48:58.428614"], ["id", 9]]
---
  def update
    if can? :update, @contract
      @contract.update(contract_params)

DELETE FROM "contracts" WHERE "contracts"."id" = ?  [["id", 8]]
---
  def destroy
    if can? :destroy, @contract
      @contract.destroy!

SELECT "contracts".* FROM "contracts" WHERE "contracts"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
    def set_contract
      @contract = Contract.find(params[:id])