rails/asudpp/app/controllers/sessions_controller.rb

  def create
    User.find_by(name: params[:name]).yield_self do |user|
---
SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "user"], ["LIMIT", 1]]