

Contract.create(name: 'Договор поставки №11/20', date: '2020-11-20', content: 'Акционерное общество «Научно-исследовательский и конструкторско-технологический институт подвижного состава» (АО «ВНИКТИ»), именуемое в дальнейшем «Поставщик»...')
Contract.create(name: 'Договор поставки №11/21', date: '2020-11-21', content: 'Акционерное общество «Научно-исследовательский и конструкторско-технологический институт подвижного состава» (АО «ВНИКТИ»), именуемое в дальнейшем «Поставщик»...')
Contract.create(name: 'Договор поставки №11/22', date: '2020-11-22', content: 'Акционерное общество «Научно-исследовательский и конструкторско-технологический институт подвижного состава» (АО «ВНИКТИ»), именуемое в дальнейшем «Поставщик»...')
Contract.create(name: 'Договор поставки №11/23', date: '2020-11-23', content: 'Акционерное общество «Научно-исследовательский и конструкторско-технологический институт подвижного состава» (АО «ВНИКТИ»), именуемое в дальнейшем «Поставщик»...')

