rails/depot3/app/views/carts/_cart.html.erb

SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = ?  [["cart_id", 1]]
---
  <ul class='list-disc list-inside'>
    <% cart.line_items.each do |item| %>